Dlubal.RFEM5.SelfWeightType
Self-weight type

Dlubal.RFEM5.SelfWeightType.UnknownSelfWeightType
Unknown self-weight type

Dlubal.RFEM5.SelfWeightType.Weight
Weight

Dlubal.RFEM5.SelfWeightType.WeightPerLength
Weight / Length

Dlubal.RFEM5.SelfWeightType.SpecificWeightAndCrScArea
Specific weight and cross-section area